Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/DataProcessors/ГрупповоеПерепроведениеДокументов/ГрупповоеПерепроведениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e6643852-2b29-4280-8c85-43901fdbd7d9">
  <name>ГрупповоеПерепроведениеДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/InformationRegisters/ГП_ПараметрыРегламентныхЗаданий/ГП_ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГП_ПараметрыРегламентныхЗаданий</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВыбранныеТипыСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Организации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_для_Казахстана_демо.ГрупповоеПерепроведениеПоРаписанию/src/DataProcessors/ГрупповоеПерепроведениеДокументов/Forms/НастройкаПараметров/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загружаем все параметры из регистра
	ПараметрыИзРегистра = РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.ПолучитьВсеПараметры();
	
	// Заполняем реквизиты формы
	ВыбранныеТипыСтрокой = ПараметрыИзРегистра.ВыбранныеТипыСтрокой;
	ДатаНачалаПроведения = ПараметрыИзРегистра.ДатаНачалаПроведения;
	КоличествоМесяцевДляПерепроведения = ПараметрыИзРегистра.КоличествоМесяцевДляПерепроведения;
	
	// Устанавливаем тип значения для списков
	СписокТиповДокументов.ТипЗначения = Новый ОписаниеТипов("Строка");
	Организации.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	
	// Десериализуем массив организаций
	СтрокаОрганизаций = ПараметрыИзРегистра.ВыбранныеОрганизации;
	Если ЗначениеЗаполнено(СтрокаОрганизаций) Тогда
		МассивОрганизаций = СериализаторXDTO.ПрочитатьXDTO(СтрокаОрганизаций);
		Если ТипЗнч(МассивОрганизаций) = Тип("Массив") Тогда
			Организации.ЗагрузитьЗначения(МассивОрганизаций);
		КонецЕсли;
	КонецЕсли;
	
	// Заполняем список типов документов
	ЗаполнитьСписокПроводимыхДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьПараметрыНаСервере();
	Оповестить("Запись_ГП_ПараметрыРегламентныхЗаданий");
	ПоказатьОповещениеПользователя("Параметры сохранены");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокТиповДокументовПриИзменении(Элемент)
	
	СписокТиповДокументовПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПроводимыхДокументов()
	
	СписокТиповДокументов.Очистить();
	
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		Если ОбъектМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			СписокТиповДокументов.Добавить(ОбъектМетаданных.Имя, ОбъектМетаданных.Представление(), Ложь);
		КонецЕсли;
	КонецЦикла;
	
	// Восстанавливаем отметки из сохраненной строки
	Если ЗначениеЗаполнено(ВыбранныеТипыСтрокой) Тогда
		МассивВыбранных = СтрРазделить(ВыбранныеТипыСтрокой, ";");
		Для Каждого Элемент Из СписокТиповДокументов Цикл
			Если МассивВыбранных.Найти(Элемент.Значение) <> Неопределено Тогда
				Элемент.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокТиповДокументовПриИзмененииНаСервере()
	
	ВыбранныеТипыДляОтбора = Новый Массив;
	Для Каждого Элемент Из СписокТиповДокументов Цикл
		Если Элемент.Пометка Тогда
			ВыбранныеТипыДляОтбора.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ВыбранныеТипыСтрокой = СтрСоединить(ВыбранныеТипыДляОтбора, ";");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыНаСервере()
	
	// Сохраняем выбранные типы документов
	ВыбранныеТипыДляОтбора = Новый Массив;
	Для Каждого Элемент Из СписокТиповДокументов Цикл
		Если Элемент.Пометка Тогда
			ВыбранныеТипыДляОтбора.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	ВыбранныеТипыСтрокой = СтрСоединить(ВыбранныеТипыДляОтбора, ";");
	
	// Сериализуем массив организаций
	МассивОрганизаций = Организации.ВыгрузитьЗначения();
	СтрокаОрганизаций = СериализаторXDTO.ЗаписатьXDTO(МассивОрганизаций);
	
	// Сохраняем все параметры через модуль менеджера
	РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.УстановитьПараметр("ВыбранныеТипыСтрокой", ВыбранныеТипыСтрокой);
	РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.УстановитьПараметр("ДатаНачалаПроведения", ДатаНачалаПроведения);
	РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.УстановитьПараметр("КоличествоМесяцевДляПерепроведения", КоличествоМесяцевДляПерепроведения);
	РегистрыСведений.ГП_ПараметрыРегламентныхЗаданий.УстановитьПараметр("ВыбранныеОрганизации", СтрокаОрганизаций);
	
КонецПроцедуры

#КонецОбласти
